IdeaRS.Connections
MemberCutPlateData Properties
Compatible with IDEA StatiCa 0.0
The MemberCutPlateData type exposes the following members.
Properties
Name | Description
CuttingMemberPath
 Gets or sets the member which owns the plate which is supposed to modify
 (Inherited from CutPlateData.)
CuttingPlatePath
 Gets or sets the cutting plane
 (Inherited from CutPlateData.)
CuttingSurface
 Gets or sets the surface of the cutting plane
 (Inherited from CutPlateData.)
FlangesWeld
 Gets or sets the properties of the weld - flanges
 (Inherited from CutPlateData.)
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
 (Inherited from CutPlateData.)
Method
 The type of cut type in case: cut by beam.
 (Inherited from CutPlateData.)
ModifiedMemberPath
 Gets or sets the member which owns the plate which is supposed to modify
 (Inherited from CutPlateData.)
ModifiedPlatePath
 Gets or sets the object to cut
 (Inherited from CutPlateData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
Offset
 Gets or sets the offset of the cut - relative to cutting plane
 (Inherited from CutPlateData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateAdjustment |  (Inherited from CutPlateData.)
RemainingPart
 Gets or sets the part of the modified item which remains in the model of connection
 (Inherited from CutPlateData.)
Weld
 Gets or sets the properties of the connected member to plate weld - other plate.ConnectionPartType than WEB
 (Inherited from CutPlateData.)
Top
See Also
Reference
MemberCutPlateData Class
IdeaRS.Connections.Data Namespace